//Умова завдання
//1.  Користувач вводить розмір масиву size.
//2.  Створити масив V1 з size елементів та заповнити його випадковими
//цілими числами.
//3.  Вивести масив на екран.
//4.  Користувач вводить число n.
//5.  Поділити масив V1 на групи по n елементів.
//6.  Для кожної групи обчислити суму елементів : S1 = x1 + x2 + … + xn S2
//= …
//7.  Записати всі отримані суми у текстовий файл e.txt.
//8.  Відсортувати масив V1 за зростанням(ASC) та знайти суму всіх
//елементів.
//9.  Відсортувати масив V1 за спаданням(DESC) та знайти суму всіх
//елементів.
//10. Видалити повторювані елементи з масиву V1 та створити новий масив
//V2.
//11. Обчислити суму елементів нового масиву V2(S3).
//12. Знайти різницю сум : S3 - S2.
//13. Порахувати кількість елементів, які повторювалися у початковому
//масиві.
//14. Зберегти результати у JSON файл :
//-S2
//- S3
//- S3 - S2
//- кількість повторюваних елементів
//- масив V1
//- масив V2
//15. Вивести на екран різницю масивів | V1 - V2 | (елементи, які були
//    видалені).



#include <iostream>

using namespace std;

int main() {
	int arr []
	cout << "Hello World!\n";
}